<?php

return [
    'forbidden' => [
        'access' => '不明なIPを検出する、またはプロキシアクセスでアクセスを禁止します',
        'bots' => 'ロボットがアクセスすることを検出し、アクセス禁止',
        'china' => '中国IPを検出するか、プロキシを使用してアクセスを禁止します。',
        'oversea' => '海外IPまたはプロキシアクセスが検出されましたアクセス禁止',
    ],
    'log' => 'ログ',
    'refresh' => '新しいブラシ',
    'refresh_page' => 'ページを更新してから次にアクセスしてください',
    'report' => 'エラー❌誤報告がある：',
    'safe_enter' => '安全なポータルへのアクセス',
    'safe_code' => '在庫探索をしない',
    'title' => '⚠️エラートリガー',
    'unsafe_enter' => '非安全なポータルへのアクセス',
    'visit' => 'サポートはこちら：',
    'whoops' => '痛い！',
    'get_ip' => 'IPメッセージの例外を取得する',
    'subscribe' => [
        'unknown' => 'リンクエラー! 取得を再試行してください！',
        'sub_baned' => 'このリンクは無効化されました。クエリ理由を参照してください',
        'user' => 'エラーリンク,アカウントが存在しません! 取得し直してください.',
        'user_disable' => '無効なアカウントです！',
        'baned_until' => 'アカウントの制限が緩和した時間をおいてから再度解除してください！',
        'out' => 'トラフィックが使い切れました。購入するか、データのリセットを再試行しましょう！',
        'expired' => 'アカウントの有効期限が切れています。お手数ですが、購読してみてください。',
        'question' => 'アカウントに問題があります。連絡先検索にアクセスしてください!',
        'none' => '利用できるノードがありません',
    ],
];
