<?php

declare(strict_types=1);

return [
    'forbidden' => [
        'access' => '不明なIP またはプロキシが検出されました。アクセス禁止',
        'bots' => 'ロボットがアクセスするとアクセスが拒否されました！',
        'china' => '中国の IP またはプロキシが検出されました。アクセス禁止 IP の表示',
        'oversea' => '海外のIPまたはプロキシが検出されました。アクセス禁止されました！',
        'redirect' => '購読リンクを使用して接続する (:IP:url) を検出しました 強制リダイレクトです',
        'unknown' => '不明なブロックモードです。 システム設定で設定を確認してください。',
    ],
    'get_ip' => 'IP データの取得に失敗しました',
    'log' => 'ログ',
    'refresh' => 'リフレッシュ',
    'refresh_page' => 'ページをリフレッシュしたら、再試行してください。',
    'report' => 'クラッシュレポート：',
    'safe_code' => '安全コードを入力してください',
    'safe_enter' => '安全な入口',
    'subscribe' => [
        'banned_until' => 'アカウントのアクセス制限が禁止されました。更新を試みてください。',
        'expired' => 'アカウントの有効期限が切れています。お手数ですが再度試してみてください',
        'none' => '利用できるノードがありません。',
        'out' => 'トラフィックは使い切れです。購入またはリセットしてください。',
        'question' => 'エラーが発生しました。ネットクエリの詳細を確認してください！',
        'sub_banned' => '購読リンクはブロックされています。理由を確認するにはホームページに移動してください！',
        'unknown' => '無効なフィードリンクです。再取得してください!',
        'user' => 'リンクが無効です。アカウントが存在しません。取得し直してください!',
        'user_disabled' => 'アカウントが停止されています!',
    ],
    'title' => '⚠️ エラーが発生しました',
    'unsafe_enter' => '安全でない入口',
    'visit' => 'アクセスしてください',
    'whoops' => 'おっと！',
];
