<?php

declare(strict_types=1);

return [
    'forbidden' => [
        'access' => '不明なIPまたはプロキシからのアクセスを検出したため、アクセスを拒否します',
        'bots' => 'ボットからのアクセスを検出したため、アクセスを拒否します',
        'china' => '中国IPまたはプロキシからのアクセスを検出したため、アクセスを拒否します',
        'oversea' => '海外IPまたはプロキシからのアクセスを検出したため、アクセスを拒否します',
    ],
    'log' => 'ログ',
    'refresh' => '更新',
    'refresh_page' => 'ページを更新してから再度お試しください',
    'report' => 'エラーに次のレポートが含まれています:',
    'safe_enter' => '安全な入口',
    'safe_code' => '安全コードを入力してください',
    'title' => '⚠️ エラーが発生しました',
    'unsafe_enter' => '安全ではない入口',
    'visit' => 'アクセスしてください',
    'whoops' => 'おっと!',
    'get_ip' => 'IP情報の取得に失敗しました',
    'subscribe' => [
        'unknown' => '不明なサブスクリプションです!新しいURLを取得してください!',
        'sub_baned' => 'サブスクリプションがBANされています! 詳細はウェブサイトをご確認ください。',
        'user' => '誤ったURLです。アカウントが存在しません!',
        'user_disable' => 'アカウントが無効化されています! サポートにお問い合わせください!',
        'baned_until' => ':timeまでアカウントはBANされています。ロック解除をお待ちください!',
        'out' => 'データが使い切られました! データを追加購入するかリセットしてください!',
        'expired' => 'アカウントの有効期限が切れています! 購入を更新してください!',
        'question' => 'アカウントにエラーが発生しています! 詳細はウェブサイトをご確認ください!',
        'none' => '使用可能なノードがありません',
    ],
];
