<?php

declare(strict_types=1);

return [
    'accept_term' => 'من خوانده‌ام و موافقم',
    'active' => [
        'attribute' => 'فعال‌سازی',
        'error' => [
            'activated' => 'حساب قبلاً فعال شده، لطفاً مستقیماً وارد شوید!',
            'disable' => 'این سایت عملکرد فعال‌سازی حساب را غیرفعال کرده، می‌توانید مستقیماً وارد شوید!',
            'throttle' => 'شما محدودیت درخواست فعال‌سازی را فعال کرده‌اید، لطفاً بعداً دوباره تلاش کنید!',
        ],
        'promotion' => 'حساب هنوز فعال نشده، لطفاً ابتدا «:action» کنید!',
        'sent' => 'لینک فعال‌سازی به ایمیل شما ارسال شد، لطفاً منتظر بمانید یا صندوق اسپم را بررسی کنید',
    ],
    'aup' => 'شرایط استفاده قابل قبول',
    'captcha' => [
        'attribute' => 'کد تأیید',
        'error' => [
            'failed' => 'کد تأیید اشتباه وارد شده، لطفاً دوباره وارد کنید!',
            'timeout' => 'کد تأیید منقضی شده، لطفاً صفحه را تازه‌سازی کرده و دوباره تلاش کنید!',
        ],
        'required' => 'لطفاً عملیات کد تأیید را به درستی تکمیل کنید',
        'sent' => 'کد تأیید به ایمیل شما ارسال شد، لطفاً منتظر بمانید یا صندوق اسپم را بررسی کنید',
    ],
    'email' => [
        'error' => [
            'banned' => 'این سایت از ارائه‌دهنده ایمیل شما پشتیبانی نمی‌کند، لطفاً ایمیل را تغییر دهید!',
            'invalid' => 'ایمیلی که وارد کرده‌اید در فهرست ایمیل‌های پشتیبانی شده این سایت نیست!',
        ],
    ],
    'error' => [
        'account_baned' => 'حساب شما موقتاً مسدود شده است. برای اطلاعات بیشتر با پشتیبانی تماس بگیرید.',
        'login_error' => 'در فرآیند ورود خطایی رخ داد، لطفاً بعداً دوباره تلاش کنید!',
        'login_failed' => 'ورود ناموفق. لطفاً نام کاربری و رمز عبور خود را بررسی کنید.',
        'not_found_user' => 'حساب مرتبطی یافت نشد، لطفاً از روش‌های دیگر برای ورود استفاده کنید!',
        'repeat_request' => 'لطفاً درخواست تکراری نکنید، صفحه را تازه‌سازی کرده و دوباره تلاش کنید!',
        'url_timeout' => 'لینک منقضی شده، لطفاً دوباره عمل کنید!',
    ],
    'failed' => 'نام کاربری یا رمز عبور اشتباه است.',
    'invite' => [
        'get' => 'کلیک برای دریافت کد دعوت',
        'not_required' => 'نیازی به کد دعوت نیست، می‌توانید مستقیماً ثبت نام کنید!',
        'unavailable' => 'کد دعوت نامعتبر است، لطفاً دوباره تلاش کنید!',
    ],
    'login' => 'ورود',
    'logout' => 'خروج',
    'maintenance' => 'تعمیر سیستم',
    'maintenance_tip' => 'سیستم در حال تعمیر است، لطفاً بعداً مراجعه کنید!',
    'oauth' => [
        'login_failed' => 'ورود از طریق شخص ثالث ناموفق!',
        'register' => 'ثبت نام سریع',
        'registered' => 'قبلاً ثبت نام کرده‌اید، لطفاً مستقیماً وارد شوید',
    ],
    'one-click_login' => 'ورود یک کلیکه',
    'optional' => 'اختیاری',
    'password' => [
        'forget' => 'رمز عبور را فراموش کرده‌اید؟',
        'new' => 'رمز عبور جدید را وارد کنید',
        'original' => 'رمز عبور اصلی',
        'reset' => [
            'attribute' => 'بازنشانی رمز عبور',
            'error' => [
                'demo' => 'محیط نمایشی تغییر رمز عبور مدیر را ممنوع کرده!',
                'disabled' => 'این سایت عملکرد بازنشانی رمز عبور را غیرفعال کرده!',
                'same' => 'رمز عبور جدید نمی‌تواند با رمز عبور قدیمی یکسان باشد، لطفاً دوباره تنظیم کنید!',
                'throttle' => 'هر 24 ساعت فقط می‌توان :time بار رمز عبور را بازنشانی کرد، لطفاً مکرراً عمل نکنید!',
                'wrong' => 'رمز عبور قدیمی اشتباه است، لطفاً دوباره وارد کنید!',
            ],
            'sent' => 'بازنشانی موفق، لطفاً ایمیل خود را بررسی کنید (ممکن است در صندوق اسپم باشد)',
            'success' => 'رمز عبور جدید با موفقیت تنظیم شد، لطفاً به صفحه ورود بروید و وارد شوید.',
        ],
    ],
    'register' => [
        'attribute' => 'ثبت نام',
        'code' => 'کد تأیید ثبت نام',
        'error' => [
            'disable' => 'متأسفیم، این سایت موقتاً کانال ثبت نام را بسته است',
            'throttle' => 'مکانیزم ضد اسپم فعال شده، لطفاً مکرراً ثبت نام نکنید',
        ],
        'failed' => 'ثبت نام ناموفق، لطفاً بعداً دوباره تلاش کنید',
        'promotion' => 'هنوز حساب ندارید؟ لطفاً ابتدا',
    ],
    'remember_me' => 'مرا به خاطر بسپار',
    'request' => 'دریافت',
    'throttle' => 'تعداد تلاش‌های ورود شما زیاد است، لطفاً :seconds ثانیه بعد دوباره تلاش کنید.',
    'tos' => 'شرایط خدمات',
];
