<?php

declare(strict_types=1);

return [
    'accept_term' => 'من شرایط را خوانده و پذیرفته‌ام',
    'active' => [
        'attribute' => 'فعال‌سازی',
        'error' => [
            'activated' => 'حساب کاربری قبلاً فعال شده است، نیازی به فعال‌سازی مجدد نیست',
            'disable' => 'فعال‌سازی حساب کاربری غیر فعال شده است، می‌توانید مستقیماً وارد شوید!',
            'throttle' => 'شما به محدودیت درخواست‌های فعال‌سازی رسیده‌اید، لطفاً بعداً دوباره تلاش کنید! اگر سوالی دارید، با :email تماس بگیرید.',
        ],
        'promotion' => 'حساب کاربری هنوز فعال نشده است، لطفاً ابتدا [:action] کنید!',
        'sent' => 'ایمیل فعال‌سازی به صندوق پستی شما ارسال شده است، لطفاً آن را بررسی کنید (شامل پوشه اسپم).',
    ],
    'aup' => 'سیاست استفاده قابل قبول',
    'captcha' => [
        'attribute' => 'کپچا',
        'error' => [
            'failed' => 'تأیید کپچا ناموفق بود، لطفاً دوباره تلاش کنید',
            'timeout' => 'کپچا منقضی شده است، لطفاً صفحه را تازه‌سازی کرده و دوباره تلاش کنید.',
        ],
        'required' => 'لطفاً کپچا را کامل کنید!',
        'sent' => 'کپچا به ایمیل شما ارسال شده است، لطفاً آن را بررسی کنید (شامل پوشه اسپم).',
    ],
    'email' => [
        'error' => [
            'banned' => 'ارائه دهنده ایمیل شما مسدود شده است، لطفاً از یک ایمیل دیگر استفاده کنید.',
            'invalid' => 'ایمیل شما پشتیبانی نمی‌شود.',
        ],
    ],
    'error' => [
        'account_baned' => 'حساب کاربری شما مسدود شده است!',
        'login_error' => 'خطای ورود، لطفاً بعداً دوباره تلاش کنید!',
        'login_failed' => 'ورود ناموفق بود، لطفاً نام کاربری و رمز عبور خود را بررسی کنید!',
        'not_found_user' => 'حسابی یافت نشد، لطفاً از روش‌های ورود دیگر استفاده کنید.',
        'repeat_request' => 'لطفاً درخواست‌های تکراری ارسال نکنید، صفحه را تازه‌سازی کرده و دوباره تلاش کنید.',
        'url_timeout' => 'لینک منقضی شده است، لطفاً دوباره درخواست کنید.',
    ],
    'failed' => 'مشخصات وارد شده با اطلاعات ما سازگار نیست.',
    'invite' => [
        'get' => 'دریافت کد دعوت',
        'not_required' => 'نیازی به کد دعوت نیست، می‌توانید مستقیماً ثبت نام کنید!',
        'unavailable' => 'کد دعوت نامعتبر است، لطفاً دوباره تلاش کنید.',
    ],
    'login' => 'ورود',
    'logout' => 'خروج',
    'maintenance' => 'نگهداری',
    'maintenance_tip' => 'در حال نگهداری',
    'oauth' => [
        'login_failed' => 'ورود با شخص ثالث ناموفق بود!',
        'register' => 'ثبت نام سریع',
        'registered' => 'قبلاً ثبت نام کرده‌اید، لطفاً مستقیماً وارد شوید.',
    ],
    'one-click_login' => 'ورود با یک کلیک',
    'optional' => 'اختیاری',
    'password' => [
        'forget' => 'رمز عبور را فراموش کرده‌اید؟',
        'new' => 'رمز عبور جدید را وارد کنید',
        'original' => 'رمز عبور فعلی',
        'reset' => [
            'attribute' => 'بازنشانی رمز عبور',
            'error' => [
                'demo' => 'در حالت دمو نمی‌توان رمز عبور ادمین را تغییر داد.',
                'disabled' => 'بازنشانی رمز عبور غیر فعال شده است، لطفاً برای کمک با :email تماس بگیرید.',
                'same' => 'رمز عبور جدید نمی‌تواند با رمز عبور قدیمی یکسان باشد، لطفاً دوباره وارد کنید.',
                'throttle' => 'شما می‌توانید فقط :time بار در 24 ساعت رمز عبور را بازنشانی کنید، لطفاً عملیات را تکرار نکنید.',
                'wrong' => 'رمز عبور اشتباه است، لطفاً دوباره تلاش کنید.',
            ],
            'sent' => 'لینک بازنشانی به صندوق پستی شما ارسال شده است، لطفاً آن را بررسی کنید (شامل پوشه اسپم).',
            'success' => 'رمز عبور جدید با موفقیت بازنشانی شد، اکنون می‌توانید وارد شوید.',
        ],
    ],
    'register' => [
        'attribute' => 'ثبت نام',
        'code' => 'کد ثبت نام',
        'error' => [
            'disable' => 'متأسفیم، ما به طور موقت پذیرش کاربران جدید را متوقف کرده‌ایم.',
            'throttle' => 'سیستم ضد ربات فعال شده است! لطفاً از ارسال مکرر خودداری کنید!',
        ],
        'failed' => 'ثبت نام ناموفق بود، لطفاً بعداً دوباره تلاش کنید.',
        'promotion' => 'هنوز حساب کاربری ندارید؟ لطفاً به ',
    ],
    'remember_me' => 'مرا به خاطر بسپار',
    'request' => 'درخواست',
    'throttle' => 'دفعات تلاش شما برای ورود بیش از حد مجاز است. لطفا پس از :seconds ثانیه مجددا تلاش فرمایید.',
    'tos' => 'شرایط خدمات',
];
