<?php

declare(strict_types=1);

return [
    'forbidden' => [
        'access' => 'IP یا پروکسی ناشناخته تشخیص داده شد، دسترسی ممنوع!',
        'bots' => 'دسترسی ربات تشخیص داده شد، دسترسی ممنوع!',
        'china' => 'IP یا پروکسی چینی تشخیص داده شد، دسترسی ممنوع!',
        'oversea' => 'IP یا پروکسی خارجی تشخیص داده شد، دسترسی ممنوع!',
        'redirect' => 'تشخیص داده شد (:ip :url) از لینک اشتراک دسترسی دارد، اجباراً تغییر مسیر داده شد',
        'unknown' => 'حالت رهگیری ناشناخته، لطفاً در تنظیمات سیستم پیکربندی را بررسی کنید!',
    ],
    'get_ip' => 'دریافت اطلاعات IP ناموفق',
    'log' => 'لاگ',
    'refresh' => 'تازه‌سازی',
    'refresh_page' => 'لطفاً صفحه را تازه‌سازی کرده و دوباره تلاش کنید',
    'report' => 'محتوای گزارش خطا:',
    'safe_code' => 'لطفاً کد امنیتی را وارد کنید',
    'safe_enter' => 'دسترسی از ورودی امن',
    'subscribe' => [
        'banned_until' => 'حساب تا :time مسدود شده، لطفاً پس از رفع مسدودی دوباره تلاش کنید!',
        'expired' => 'حساب منقضی شده، لطفاً پس از تمدید استفاده کنید!',
        'none' => 'موقتاً نود قابل استفاده‌ای وجود ندارد',
        'out' => 'ترافیک تمام شده، لطفاً خریداری کنید یا ترافیک را بازنشانی کنید!',
        'question' => 'حساب دارای ناهنجاری است، لطفاً به وب‌سایت رسمی بروید و جزئیات را بررسی کنید!',
        'sub_banned' => 'لینک اشتراک مسدود شده، لطفاً به وب‌سایت رسمی بروید و دلیل را بفهمید!',
        'unknown' => 'لینک اشتراک نامعتبر، لطفاً دوباره دریافت کنید!',
        'user' => 'لینک نامعتبر، حساب وجود ندارد، لطفاً دوباره دریافت کنید!',
        'user_disabled' => 'حساب غیرفعال شده!',
    ],
    'title' => '⚠️ خطا رخ داد',
    'unsafe_enter' => 'دسترسی از ورودی غیرامن',
    'visit' => 'لطفاً مراجعه کنید',
    'whoops' => 'اوه!',
];
