<?php

declare(strict_types=1);

return [
    'forbidden' => [
        'access' => 'آی‌پی یا پروکسی ناشناس شناسایی شد، دسترسی ممنوع',
        'bots' => 'دسترسی ربات شناسایی شد، دسترسی ممنوع',
        'china' => 'آی‌پی یا پروکسی چین شناسایی شد، دسترسی ممنوع',
        'oversea' => 'آی‌پی یا پروکسی خارجی شناسایی شد، دسترسی ممنوع',
    ],
    'log' => 'لاگ',
    'refresh' => 'بازخوانی',
    'refresh_page' => 'لطفاً صفحه را بازخوانی کرده و دوباره امتحان کنید',
    'report' => 'خطا حامل گزارشی بود:',
    'safe_enter' => 'ورود امن',
    'safe_code' => 'لطفاً کد امنیتی را وارد کنید',
    'title' => '⚠️ خطا رخ داد',
    'unsafe_enter' => 'ورود ناامن',
    'visit' => 'لطفاً به آدرس زیر مراجعه کنید',
    'whoops' => 'اوه!',
    'get_ip' => 'دریافت اطلاعات آی‌پی با شکست مواجه شد',
    'subscribe' => [
        'unknown' => 'لینک اشتراک نامعتبر! لطفاً لینک جدید دریافت کنید',
        'sub_baned' => 'اشتراک مسدود شده است! برای جزئیات به وب‌سایت مراجعه کنید',
        'user' => 'لینک اشتباه، حساب کاربری وجود ندارد!',
        'user_disable' => 'حساب کاربری غیرفعال شده است! با پشتیبانی تماس بگیرید!',
        'baned_until' => 'حساب کاربری تا :time مسدود شده است، لطفاً منتظر باز شدن بمانید!',
        'out' => 'حجم تمام شده است! لطفاً حجم بیشتری خریداری کنید یا حجم را بازنشانی کنید!',
        'expired' => 'حساب کاربری منقضی شده است! لطفاً خرید خود را تمدید کنید!',
        'question' => 'مشکل در حساب کاربری! برای جزئیات به وب‌سایت مراجعه کنید',
        'none' => 'هیچ گره در دسترسی نیست',
    ],
];
