<?php

declare(strict_types=1);

return [
    'forbidden' => [
        'access' => 'دسترسی IP یا پروکسی ناشناخته شناسایی شد، دسترسی ممنوع',
        'bots' => 'دسترسی ربات شناسایی شد، دسترسی ممنوع',
        'china' => 'دسترسی IP یا پروکسی چین شناسایی شد، دسترسی ممنوع',
        'oversea' => 'دسترسی IP یا پروکسی خارج از کشور شناسایی شد، دسترسی ممنوع',
        'redirect' => '(:ip :url) از طریق پیوند اشتراک دسترسی شناسایی شد، تغییر مسیر اجباری.',
        'unknown' => 'حالت دسترسی ممنوع ناشناخته! لطفاً [حالت مسدودسازی] را در تنظیمات سیستم تغییر دهید!',
    ],
    'get_ip' => 'دریافت اطلاعات IP ناموفق بود',
    'log' => 'لاگ',
    'refresh' => 'تازه‌سازی',
    'refresh_page' => 'لطفاً صفحه را تازه‌سازی کنید و دوباره تلاش کنید',
    'report' => 'خطا حاوی گزارشی بود: ',
    'safe_code' => 'لطفاً کد ایمنی را وارد کنید',
    'safe_enter' => 'ورود امن',
    'subscribe' => [
        'banned_until' => 'حساب تا :time ممنوع شده، لطفاً برای باز شدن صبر کنید!',
        'expired' => 'حساب منقضی شده! لطفاً اشتراک خود را تمدید کنید!',
        'none' => 'هیچ گره‌ای در دسترس نیست',
        'out' => 'داده تمام شده! لطفاً بیشتر خریداری کنید یا داده را بازنشانی کنید!',
        'question' => 'مشکلات حساب؟! برای جزئیات به وب‌سایت مراجعه کنید',
        'sub_banned' => 'اشتراک ممنوع شده! برای جزئیات به وب‌سایت مراجعه کنید',
        'unknown' => 'لینک اشتراک نامعتبر است! لطفاً لینک جدیدی دریافت کنید!',
        'user' => 'URL نامعتبر است، حساب وجود ندارد!',
        'user_disabled' => 'حساب غیرفعال شده است! با پشتیبانی تماس بگیرید!',
    ],
    'title' => '⚠️ خطا رخ داد',
    'unsafe_enter' => 'ورود ناامن',
    'visit' => 'لطفاً مراجعه کنید به',
    'whoops' => 'اوپس!',
];
