<?php

declare(strict_types=1);

return [
    'attribute' => 'اعلان',
    'new' => 'شما :num پیام جدید دارید',
    'empty' => 'شما در حال حاضر هیچ پیام جدیدی ندارید',
    'payment_received' => 'پرداخت سفارش شما با مبلغ :amount با موفقیت انجام شد، لطفاً برای مشاهده جزئیات سفارش کلیک کنید',
    'account_expired' => 'یادآوری انقضای حساب',
    'account_expired_content' => 'حساب شما در :days روز آینده منقضی خواهد شد، لطفاً برای جلوگیری از هرگونه مشکل در استفاده به موقع تمدید کنید',
    'account_expired_blade' => 'حساب شما در :days روز آینده منقضی خواهد شد، لطفاً به موقع تمدید کنید',
    'active_email' => 'لطفاً در عرض 30 دقیقه تأیید را تکمیل کنید',
    'close_ticket' => 'تیکت شماره :id با عنوان :title بسته شده است',
    'view_web' => 'بازدید از وب‌سایت ما',
    'view_ticket' => 'مشاهده وضعیت این تیکت',
    'new_ticket' => 'تیکت جدید شما با عنوان :title دریافت شد، لطفاً برای مشاهده مراجعه کنید',
    'reply_ticket' => 'پاسخ تیکت: :title',
    'ticket_content' => 'محتوای تیکت:',
    'node_block' => 'هشدار مسدود شدن گره',
    'node_offline' => 'هشدار آفلاین بودن گره',
    'node_offline_content' => 'گره‌های زیر غیرعادی هستند و ممکن است آفلاین باشند:',
    'block_report' => 'گزارش مسدود شدن:',
    'traffic_warning' => 'هشدار استفاده از داده',
    'traffic_remain' => 'شما :percent% از داده خود را استفاده کرده‌اید، لطفاً توجه کنید',
    'traffic_tips' => 'لطفاً به تاریخ بازنشانی داده توجه کنید و داده‌ها را به صورت منطقی استفاده کنید یا پس از اتمام، مجدداً شارژ کنید',
    'verification_account' => 'تأیید حساب',
    'verification' => 'کد تأیید شما:',
    'verification_limit' => 'لطفاً در عرض :minutes دقیقه تأیید را تکمیل کنید',
    'data_anomaly' => 'هشدار کاربر با داده غیرعادی',
    'data_anomaly_content' => 'کاربر :id: [آپلود: :upload | دانلود: :download | مجموع: :total] در ساعت گذشته',
    'node' => [
        'upload' => 'آپلود',
        'download' => 'دانلود',
        'total' => 'مجموع',
    ],
];
