<ol>
    <li><a href="clients/ShadowsocksX-NG-R8-1.4.6.dmg" target="_blank">点击此处</a>下载客户端并启动</li>
    <li> 点击状态栏纸飞机 -&gt; 服务器 -&gt; 编辑订阅</li>
    <li> 点击窗口左下角 “+”号 新增订阅，完整复制本页上方“订阅服务”处地址，将其粘贴至“订阅地址”栏，点击右下角“OK”</li>
    <li> 点击纸飞机 -&gt; 服务器 -&gt; 手动更新订阅</li>
    <li> 点击纸飞机 -&gt; 服务器，选定合适服务器</li>
    <li> 点击纸飞机 -&gt; 打开Shadowsocks</li>
    <li> 点击纸飞机 -&gt; PAC自动模式</li>
    <li> 点击纸飞机 -&gt; 代理设置-&gt;从 GFW List 更新 PAC</li>
    <li> 打开系统偏好设置 -&gt; 网络，在窗口左侧选定显示为“已连接”的网络，点击右下角“高级...”</li>
    <li> 切换至“代理”选项卡，勾选“自动代理配置”和“不包括简单主机名”，点击右下角“好”，再次点击右下角“应用”</li>
</ol>