<?php

return [
    'title'                => '注册',
    'username'             => '用戶名',
    'username_placeholder' => '請填入郵箱',
    'password'             => '請填入密碼',
    'retype_password'      => '請再次填入密碼',
    'code'                 => '邀請碼',
    'captcha'              => '驗證碼',
    'tnc_button'           => '我已閱讀並同意遵守',
    'tnc_link'             => '服務條款',
    'register_alter'       => '系統維護中',
    'get_free_code'        => '點擊獲取免費邀請碼',
    'back'                 => '返 回',
    'submit'               => '提 交',
    'tnc_title'            => '我已完整閱讀，並承諾遵守',
    'tnc_content'          => '不得通過本站提供的服務發佈、轉載、傳送含有下列內容之一的資訊：<br>1.違反憲法確定的基本原則的；<br>2.危害國家安全，洩漏國家機密，顛覆國家政權，破壞國家統一的；<br>3.損害國家榮譽和利益的；<br>4.煽動民族仇恨、民族歧視，破壞民族團結的；<br>5.破壞國家宗教政策，宣揚邪教和封建迷信的；<br>6.散佈謠言，擾亂社會秩序，破壞社會穩定的；<br>7.散佈淫穢、色情、賭博、暴力、恐怖或者教唆犯罪的；<br>8.侮辱或者誹謗他人，侵害他人合法權益的；<br>9.煽動非法集會、結社、遊行、示威、聚眾擾亂社會秩序的；<br>10.以非法民間組織名義活動的；<br>11.含有法律、行政法規禁止的其他內容的。',
];